{
  "id": "0xb0e6142e2438b8c2e5af608e49902f28b7b16359b14c430ea10e3dcea5a1e145",
  "title": "[BIP-492] Enable weETH/WETH Gauge [Ethereum]",
  "body": "### PR with Payload\nhttps://github.com/BalancerMaxis/multisig-ops/pull/645\n\n**Summary:**\nThe [ether.fi](https://www.ether.fi/) team proposes a Balancer Boosted Gauge for a weETH-WETH pool on Ethereum mainnet, with a 10% emissions cap.\n\n**References/Useful links:**\n\n    • Website - https://www.ether.fi/\n    • Documentation - https://etherfi.gitbook.io/etherfi/ether.fi-whitepaper\n    • Github Page - https://github.com/etherfi-protocol\n    • Discord - https://discord.com/invite/zqGzcuQWvD\n    • Twitter - https://twitter.com/ether_fi\n\n**Protocol Description:**\n\nEther.fi is a decentralized, non-custodial liquid staking protocol built on Ethereum, allowing users to stake their ETH and participate in the DeFi ecosystem without losing liquidity. The protocols eETH is a liquid restaking token (weETH is the non-rebasing equivalent), serving as a representation of ETH staked on the Beacon Chain, which rebases daily to reflect the associated staking rewards. Users can deposit ETH into the liquidity pool to mint eETH, hold eETH to accrue rewards, and use eETH within DeFi or swap it back to ETH at any time via the liquidity pool. The protocol currently employs a permissioned validator set, however this will transition to permisionless based on the protocol roadmap.\n\nETH staked through the ether.fi protocol liquidity pool accrues normal Ethereum staking rewards, and will also be natively restaked with EigenLayer. Currently when users wish to restake their LST’s they lock their tokens, which breaks composability in DeFi. Staking with eETH on [ether.fi](http://ether.fi) automatically natively restakes that ETH to EigenLayer and accrues normal staking rewards while allowing users to keep composability on their eETH in other DeFi protocols. No other liquid staking protocol has this capability.\n\nThe eETH contract has been live since June 2023 and has approx. 10,000 ETH held within in - this ETH was accumulated before eETH was officially launched and available for end users to hold directly. Being a liquid representation of staked Ethereum, the price of the token is aligned to the price of ETH.\n\nThrough these mechanisms, eETH acts as a conduit for individuals to engage in Ethereum's staking & restaking process with the added liquidity, making it easier for them to enter and exit staking positions while also benefiting from boosted rewards.\n\n**Motivation:**\n\nEther.fi is looking to seed a weETH/wETH pool on balancer to serve as a primary source of liquidity for eETH. Incentivising a Balancer pool could significantly boost the liquidity of the LRT. Higher liquidity ensures that traders and investors can easily enter or exit positions, which is essential for the overall usability and attractiveness of the LRT token within the DeFi ecosystem. To ensure success, ether.fi is committed to enhancing the value of the veBAL ecosystem by promoting pool liquidity through Hidden Hand voting incentives\n\n**Specifications:**\n \n1. **Governance:**  - Currently, the protocol utilises a multi signature wallet, with the signatories being doxxed ether.fi executives. This will change with the evolution of the protocol, moving to decentralized governance with a DAO and a governance token in approx. 3-6 months.\n\n2. **Oracles:** - The Protocol relies on an oracle for withdrawals and beacon state, however, the reliance on an oracle for beacon state is set to go away in an upcoming Ethereum upgrade. The Oracle is based on the hash consensus mechanism and run by the committee members. Initially, the ether.fi team will be the only ones to operate the Oracle nodes, however the protocol grows, it will add more external parties to join the committee.\n\n3. **Audits:** - Audit reports for the ether.fi protocol are found on the GitBook page - https://etherfi.gitbook.io/etherfi/security/audits. The audits have been carried out by reputable firms such as Certik, Zellic, Nethermind, Omniscia and Solidified to ensure the security of the protocol. An audit competition was also recently completed through Hats Finance. \n\n4. **Centralization vectors:** - The centralization vectors primarily relate to the Oracle until it becomes decentralized, in line with the protocol roadmap. The price (staking rewards for rebasing) and the validator management (spinning up new validators and exiting them for liquidation) are also currently centralized for the early stages of the protocol to ensure mobility. As mentioned above, the signatories currently consist of the doxxed executive team at Ether.fi, however this will be upgraded with the implementation of the ether.fi DAO and governance.\n\n5. **Market History:** eETH is a brand new Liquid restaking token, therefore there is not much in the way of market history as Balancer will serve as the first pool to support wrapped eETH. \nweETH/wETH pool on Balancer: [0xb9dEbDDF1d894c79D2B2d09f819FF9B856FCa552](https://etherscan.io/address/0xb9debddf1d894c79d2b2d09f819ff9b856fca552)\nGauge: [0x5D7C0521DB5a6F37aD839d0eEfbaF8205389adD8](https://etherscan.io/address/0x5D7C0521DB5a6F37aD839d0eEfbaF8205389adD8) \n\n6. **Value:** - The weETH/wETH pool on Balancer is intended to serve as a primary liquidity source for the token. The pairing of eETH with wETH allows for a more seamless trading experience within the Ethereum ecosystem, which could attract more users and, in turn, generate more fees for the platform.\n\n**Specification**:\n\nThe Balancer Maxi LM Multisig eth:`0xc38c5f97B34E175FFd35407fc91a937300E33860` will interact with the GaugeAdderv4 at `0x5DbAd78818D4c8958EfF2d5b95b28385A22113Cd` and call the addGauge function with the following arguments:\ngauge(address):`0x5D7C0521DB5a6F37aD839d0eEfbaF8205389adD8`\ngaugeType(string): `Ethereum`",
  "author": "0x021C5536bd60bCe9f15FB0E32746e332E3fbFAF4",
  "choices": [
    "Yes, let's do it",
    "No, this is not the way",
    "Abstain"
  ],
  "discussion": "https://forum.balancer.fi/t/bip-492-enable-weeth-weth-gauge-ethereum/5353",
  "start": 1700766000,
  "end": 1701054000,
  "state": "closed",
  "space": {
    "id": "aurafinance.eth",
    "name": "Aura Finance",
    "strategies": [
      {
        "name": "erc20-balance-of",
        "network": "1",
        "params": {
          "symbol": "vlAURA",
          "address": "0x3fa73f1e5d8a792c80f426fc8f84fbf7ce9bbcac",
          "decimals": 18
        }
      },
      {
        "name": "delegation-with-overrides",
        "network": "1",
        "params": {
          "symbol": "vlAURA (delegated)",
          "overrides": {
            "0x2ad55394E12016c510D3C35d91Da7d90A758b7FD": "0x1f4F47f8b55CCd4e3b674Db90E4277b7073fdE27"
          },
          "strategies": [
            {
              "name": "erc20-balance-of",
              "params": {
                "symbol": "vlAURA",
                "address": "0x3fa73f1e5d8a792c80f426fc8f84fbf7ce9bbcac",
                "decimals": 18
              },
              "delegationSpace": "aurafinance.eth"
            }
          ],
          "delegationSpace": "aurafinance.eth"
        }
      },
      {
        "name": "erc20-balance-of",
        "network": "8453",
        "params": {
          "symbol": "vlAURA",
          "address": "0x9e1f4190f1a8Fe0cD57421533deCB57F9980922e",
          "decimals": 18
        }
      }
    ]
  }
}